app/controllers/books_controller.rb

  def select_item
    # Query api again with owi number for selected book to get detailed listing
    # (including oclc needed by GoogleBooksAPI)
    @book_data = CallClassifyAPI.query_and_extract_book({ "owi" => params["owi"] }, false)
    @book_data["thumbnail_url"] = CallGoogleBooksAPI.query_and_extract_thumbnail_url("OCLC" => @book_data["oclc"])
    book = Book.create_with(@book_data).find_or_create_by(oclc: @book_data["oclc"])
---
INSERT INTO "books" ("title", "author", "format", "language", "oclc", "thumbnail_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "books".* FROM "books" WHERE "books"."oclc" = ? LIMIT 1  [["oclc", "41002882"]]

  def user_collection
    UserMailer.password_reset_email(current_user)
    @current_user_library = current_user.books.all
---
SELECT "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = ?  [["user_id", 1]]

  def detailed_book_info
    # Fetch info about book
    oclc_num = params["oclc"]
    @book_of_interest = Book.where(oclc: oclc_num).first
    @book_comments = current_user.comments.where(book_id: @book_of_interest.id)
    book_recommendation = current_user.recommendations.where(recommended: true, book_id: @book_of_interest.id)
---
SELECT  "books".* FROM "books" WHERE "books"."oclc" = ?  ORDER BY "books"."id" ASC LIMIT 1  [["oclc", "41002882"]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."book_id" = ?  [["user_id", 1], ["book_id", 1]]
SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."user_id" = ? AND "recommendations"."book_id" = ? AND "recommendations"."recommended" = 't'  [["user_id", 1], ["book_id", 1]]

  def destroy
    # Remove book from user's library
    book_id = params[:id]
    @transaction = current_user.books.delete(book_id) if current_user.books.find_by(id: book_id)
---
SELECT  "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = ? AND "books"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]