app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" INNER JOIN "books_users" ON "books"."id" = "books_users"."book_id" WHERE "books_users"."user_id" = ? AND "books"."oclc" = ?  ORDER BY "books"."id" ASC LIMIT 1  [["user_id", 1], ["oclc", "41002882"]]
INSERT INTO "comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["comment", "<110 bytes of binary data>"], ["created_at", "2015-06-25 15:38:16.985592"], ["updated_at", "2015-06-25 15:38:16.985592"]]
---
  def add_comment
    oclc = params[:oclc]
    comment = params[:comment]
    book = current_user.books.where(oclc: oclc).first
    return 'Book not found' unless book
    Comment.create(user_id: current_user.id, book_id: book.id, comment: comment)

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ?  ORDER BY "comments"."id" ASC LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def delete_comment
    comment_id = params[:comment_id].to_i
    # Is it better to look up the comment from the comments table and then see
    # if it belongs to the user or to look up all the users comments and then
    # find the one we are looking for?
    comment_to_delete = current_user.comments.where(id: comment_id).first
    return 'Cannot find a comment with this id for current user' unless comment_to_delete
    comment_to_delete.destroy